Catalogs/УчетныеЗаписиЦентровЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиЦентровЭДО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешАдресаСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/УчетныеЗаписиЦентровЭДО/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ДанныеУчетнойЗаписи

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЦентровЭДО
// 
// Возвращаемое значение:
//  Строка
Функция АдресСервиса(УчетнаяЗапись) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "АдресСервиса");
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЦентровЭДО
// 
// Возвращаемое значение:
//  - Неопределено
//  - См. ИнтеграцияЦентраЭДО.НовыйТокенАвторизации
Функция ТокенАвторизацииСлужебный(УчетнаяЗапись) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ТокенАвторизации = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(УчетнаяЗапись,
		КлючТокенаАвторизацииВБезопасномХранилище()); // См. ИнтеграцияЦентраЭДО.НовыйТокенАвторизации
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ТокенАвторизации;
КонецФункции

// Возвращаемое значение:
//  - Неопределено - если нет элементов или элементов больше одного.
//  - СправочникСсылка.УчетныеЗаписиЦентровЭДО
Функция ЕдинственнаяУчетнаяЗапись() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	УчетныеЗаписиЦентровЭДО.Ссылка
		|ИЗ
		|	Справочник.УчетныеЗаписиЦентровЭДО КАК УчетныеЗаписиЦентровЭДО";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() <> 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ВыборкаУчетныхЗаписей

// Параметры:
//  АдресСервиса - Строка
// 
// Возвращаемое значение:
//  СправочникСсылка.УчетныеЗаписиЦентровЭДО
Функция НайтиПоАдресуСервиса(АдресСервиса) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетныеЗаписиЦентровЭДО.Ссылка,
		|	УчетныеЗаписиЦентровЭДО.АдресСервиса
		|ИЗ
		|	Справочник.УчетныеЗаписиЦентровЭДО КАК УчетныеЗаписиЦентровЭДО
		|ГДЕ
		|	УчетныеЗаписиЦентровЭДО.ХешАдресаСервиса = &ХешАдресаСервиса";
		
	ХешАдресаСервиса = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(АдресСервиса);
	Запрос.УстановитьПараметр("ХешАдресаСервиса", ХешАдресаСервиса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.АдресСервиса = АдресСервиса Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПустаяСсылка();
КонецФункции

// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//  * Ссылка - СправочникСсылка.УчетныеЗаписиЦентровЭДО
Функция ВыбратьСсылки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетныеЗаписиЦентровЭДО.Ссылка
		|ИЗ
		|	Справочник.УчетныеЗаписиЦентровЭДО КАК УчетныеЗаписиЦентровЭДО
		|ГДЕ
		|	НЕ УчетныеЗаписиЦентровЭДО.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

#КонецОбласти

#Область ПодключениеЦентраЭДО

// Параметры:
//  ПараметрыПользователя - См. РегистрыСведений.ПользователиЦентраЭДО.НовыеПараметрыПользователя
//  КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// 
// Возвращаемое значение:
//  СправочникСсылка.УчетныеЗаписиЦентровЭДО
Функция Добавить(ПараметрыПользователя, КонтекстДиагностики) Экспорт
	
	ПараметрыДобавления = ПараметрыДобавленияУчетнойЗаписиЦентраЭДО(ПараметрыПользователя, КонтекстДиагностики);
	
	Если Не ЗначениеЗаполнено(ПараметрыДобавления.ТокенАвторизации) Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		УчетнаяЗапись = СоздатьЭлемент();
		УчетнаяЗапись.Наименование = ПараметрыДобавления.Наименование;
		УчетнаяЗапись.АдресСервиса = ПараметрыПользователя.АдресСервиса;
		УчетнаяЗапись.Записать();
		
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(УчетнаяЗапись.Ссылка,
			ПараметрыДобавления.ТокенАвторизации, КлючТокенаАвторизацииВБезопасномХранилище());
		УстановитьПривилегированныйРежим(Ложь);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ТекстСообщения = НСтр("ru = 'Ошибка создания учетной записи центра ЭДО.'") + Символы.ПС
			+ ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(НСтр("ru = 'Создание учетной записи центра ЭДО.'"),
			ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), ТекстСообщения);
		ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
		ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
		Возврат ПустаяСсылка();
	КонецПопытки;
	
	Возврат УчетнаяЗапись.Ссылка;
	
КонецФункции

// Параметры:
//  ПараметрыПользователя - См. Добавить.ПараметрыПользователя
//  КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// 
// Возвращаемое значение:
//  Структура:
//  * Наименование - Строка
//  * ТокенАвторизации - Неопределено
//                     - См. ИнтеграцияЦентраЭДО.НовыйТокенАвторизации
Функция ПараметрыДобавленияУчетнойЗаписиЦентраЭДО(ПараметрыПользователя, КонтекстДиагностики)
	
	ПараметрыДобавления = Новый Структура;
	ПараметрыДобавления.Вставить("Наименование", "");
	ПараметрыДобавления.Вставить("ТокенАвторизации", Неопределено);
	
	ПараметрыВыполнения = ИнтеграцияЦентраЭДО.НовыеПараметрыВыполненияМетодаСервиса();
	ПараметрыВыполнения.АдресСервиса = ПараметрыПользователя.АдресСервиса;
	ПараметрыВыполнения.ТокенАвторизации = ИнтеграцияЦентраЭДО.ТокенАвторизацииБазовый(
		ПараметрыПользователя.Логин, ПараметрыПользователя.Пароль);
	
	ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса("НастройкаПодключения",
		ОбщегоНазначенияБЭД.ИдентификаторПриложения());
	НастройкаПодключения = ИнтеграцияЦентраЭДО.ВыполнитьМетодСервиса(ПараметрыВыполнения, ОписаниеМетода,
		КонтекстДиагностики); // См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.НастройкаПодключения
	
	Если Не ЗначениеЗаполнено(НастройкаПодключения) Тогда
		Возврат ПараметрыДобавления;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкаПодключения.Ошибка) Тогда
		ТекстОшибки = НастройкаПодключения.Ошибка;
		Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(
			НСтр("ru = 'Получение настройки подключения.'"),
			ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
			ТекстОшибки, ТекстОшибки);
		ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка,
			ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ОбменСКонтрагентами);
		Возврат ПараметрыДобавления;
	КонецЕсли;
	
	ПараметрыДобавления.Наименование = НастройкаПодключения.Наименование;
	ПараметрыДобавления.ТокенАвторизации = НастройкаПодключения.ТокенАвторизации;
	
	Возврат ПараметрыДобавления;
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЦентровЭДО
// 
// Возвращаемое значение:
//  См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
Функция Обновить(УчетнаяЗапись) Экспорт
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	Попытка
		ПараметрыВыполнения = ИнтеграцияЦентраЭДОПовтИсп.ПараметрыВыполненияМетодаСервиса(
			УчетнаяЗапись, Пользователи.ТекущийПользователь());
	Исключение
		ВидОперации = НСтр("ru = 'Обновление настроек учетной записи'");
		ВидОшибки = ИнтеграцияЦентраЭДО.ВидОшибкиОтсутствуютДанныеАвторизации(УчетнаяЗапись);
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации, ВидОшибки, ТекстОшибки, ТекстОшибки);
		ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка,
			ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ИнтеграцияЦентраЭДО);
		Возврат КонтекстДиагностики;
	КонецПопытки;
	
	ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса("НастройкаПодключения",
		ОбщегоНазначенияБЭД.ИдентификаторПриложения());
	НастройкаПодключения = ИнтеграцияЦентраЭДО.ВыполнитьМетодСервиса(ПараметрыВыполнения, ОписаниеМетода,
		КонтекстДиагностики); // См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.НастройкаПодключения
	
	ОшибкиДиагностики = ОбработкаНеисправностейБЭДКлиентСервер.ПолучитьОшибки(КонтекстДиагностики);
	Если ЗначениеЗаполнено(ОшибкиДиагностики)
		Или Не ЗначениеЗаполнено(НастройкаПодключения.ТокенАвторизации) Тогда
		Возврат КонтекстДиагностики;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(УчетнаяЗапись,
		НастройкаПодключения.ТокенАвторизации, КлючТокенаАвторизацииВБезопасномХранилище());
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат КонтекстДиагностики;
	
КонецФункции

// Возвращаемое значение:
//  Строка
Функция КлючТокенаАвторизацииВБезопасномХранилище()
	
	Возврат "ТокенАвторизации";
	
КонецФункции

#КонецОбласти

#Область Сервис1СФреш

// Возвращаемое значение:
//  Строка
Функция АдресСервиса1СФреш() Экспорт
	Возврат "https://1cfresh.com";
КонецФункции

// Параметры:
//  АдресСервиса - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоСервис1СФреш(АдресСервиса) Экспорт
	Возврат СтрНачинаетсяС(АдресСервиса, АдресСервиса1СФреш());
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
